#!/usr/bin/env python3
"""
TG-Sync: Помощник первоначальной настройки.
Запустите этот скрипт ПЕРЕД основным запуском.

Что делает:
1. Создаёт .env файл с вашими данными
2. Помогает авторизовать аккаунты (создаёт session-файлы)
3. Помогает узнать ID хаб-группы и модератора

Запуск: python setup.py
"""

import asyncio
import os
import shutil
from pathlib import Path


def print_header():
    print()
    print("=" * 50)
    print("  TG-Sync: Первоначальная настройка")
    print("=" * 50)
    print()


def print_step(n, title):
    print(f"\n{'─' * 40}")
    print(f"  Шаг {n}: {title}")
    print(f"{'─' * 40}\n")


def setup_env():
    """Создать .env файл."""
    if os.path.exists(".env"):
        resp = input("⚠️  .env уже существует. Перезаписать? (y/n): ")
        if resp.lower() != "y":
            print("Пропускаем создание .env")
            return

    print_step(1, "Telegram API Credentials")
    print("Перейдите на https://my.telegram.org → API Development")
    print("Создайте приложение и скопируйте api_id и api_hash\n")

    work_api_id = input("Аккаунт 1 (рабочий) — api_id: ").strip()
    work_api_hash = input("Аккаунт 1 (рабочий) — api_hash: ").strip()
    work_phone = input("Аккаунт 1 (рабочий) — номер телефона (+7...): ").strip()

    print()
    personal_api_id = input("Аккаунт 2 (личный) — api_id: ").strip()
    personal_api_hash = input("Аккаунт 2 (личный) — api_hash: ").strip()
    personal_phone = input("Аккаунт 2 (личный) — номер телефона (+7...): ").strip()

    print_step(2, "Бот")
    print("Создайте бота через @BotFather в Telegram")
    print("Скопируйте токен бота\n")

    bot_token = input("Bot Token: ").strip()

    print_step(3, "Хаб-группа")
    print("1. Создайте приватную группу в Telegram")
    print("2. Добавьте бота в группу с правами админа")
    print("3. Добавьте Викторию в группу")
    print("4. ID группы узнаем на следующем шаге\n")

    hub_chat_id = input("Hub Chat ID (или оставьте пустым — узнаем позже): ").strip() or "0"

    print_step(4, "ID модератора")
    print("Отправьте команду /start боту @userinfobot в Telegram")
    print("Он покажет ваш User ID\n")

    moderator_id = input("User ID Виктории: ").strip()

    # Записываем .env
    env_content = f"""# ============================================
# TG-Sync Configuration
# Generated by setup.py
# ============================================

# Аккаунт 1 — Рабочий
ACCOUNT_WORK_API_ID={work_api_id}
ACCOUNT_WORK_API_HASH={work_api_hash}
ACCOUNT_WORK_PHONE={work_phone}

# Аккаунт 2 — Личный
ACCOUNT_PERSONAL_API_ID={personal_api_id}
ACCOUNT_PERSONAL_API_HASH={personal_api_hash}
ACCOUNT_PERSONAL_PHONE={personal_phone}

# Бот
BOT_TOKEN={bot_token}
HUB_CHAT_ID={hub_chat_id}
MODERATOR_USER_ID={moderator_id}

# AI (опционально)
ANTHROPIC_API_KEY=
AI_ENABLED=false

# Настройки
LOG_LEVEL=INFO
DB_PATH=data/messages.db
REPLY_DELAY_SECONDS=1
AUTO_REPLY_ENABLED=false
AUTO_REPLY_TIMEOUT_MINUTES=30
AUTO_REPLY_TEXT=Виктория ответит в ближайшее время. Спасибо за ожидание!
"""

    with open(".env", "w") as f:
        f.write(env_content)

    print("\n✅ .env файл создан!")


async def authorize_accounts():
    """Авторизовать аккаунты (создать session-файлы)."""
    print_step(5, "Авторизация аккаунтов")

    try:
        from telethon import TelegramClient
        from dotenv import load_dotenv
        load_dotenv()
    except ImportError:
        print("⚠️  Сначала установите зависимости: pip install -r requirements.txt")
        return

    Path("data/sessions").mkdir(parents=True, exist_ok=True)

    accounts = [
        ("work", os.getenv("ACCOUNT_WORK_API_ID"), os.getenv("ACCOUNT_WORK_API_HASH"), os.getenv("ACCOUNT_WORK_PHONE")),
        ("personal", os.getenv("ACCOUNT_PERSONAL_API_ID"), os.getenv("ACCOUNT_PERSONAL_API_HASH"), os.getenv("ACCOUNT_PERSONAL_PHONE")),
    ]

    for name, api_id, api_hash, phone in accounts:
        if not api_id or not api_hash or api_id == "0":
            print(f"⏭  Пропуск аккаунта '{name}': нет credentials")
            continue

        print(f"\n📱 Авторизация аккаунта: {name} ({phone})")
        print("Telegram отправит код подтверждения...\n")

        client = TelegramClient(
            f"data/sessions/{name}",
            int(api_id),
            api_hash,
        )

        await client.start(phone=phone)
        me = await client.get_me()
        print(f"✅ {name}: Авторизован как {me.first_name} (ID: {me.id})")
        await client.disconnect()

    # Авторизация бота
    bot_token = os.getenv("BOT_TOKEN")
    if bot_token:
        print(f"\n🤖 Проверка бота...")
        # Для бота нужен api_id/hash любого аккаунта
        api_id = os.getenv("ACCOUNT_WORK_API_ID", "0")
        api_hash = os.getenv("ACCOUNT_WORK_API_HASH", "")
        if api_id != "0":
            bot = TelegramClient("data/sessions/bot", int(api_id), api_hash)
            await bot.start(bot_token=bot_token)
            bot_me = await bot.get_me()
            print(f"✅ Бот: @{bot_me.username} (ID: {bot_me.id})")
            await bot.disconnect()


async def find_hub_chat_id():
    """Помочь найти ID хаб-группы."""
    print_step(6, "Определение ID хаб-группы")

    try:
        from telethon import TelegramClient
        from dotenv import load_dotenv
        load_dotenv()
    except ImportError:
        return

    api_id = os.getenv("ACCOUNT_WORK_API_ID", "0")
    api_hash = os.getenv("ACCOUNT_WORK_API_HASH", "")
    phone = os.getenv("ACCOUNT_WORK_PHONE", "")

    if api_id == "0":
        print("⚠️  Нет credentials для поиска групп")
        return

    client = TelegramClient("data/sessions/work", int(api_id), api_hash)
    await client.start(phone=phone)

    print("Ваши последние диалоги:\n")
    async for dialog in client.iter_dialogs(limit=20):
        type_label = "👤" if dialog.is_user else "👥" if dialog.is_group else "📢"
        print(f"  {type_label} {dialog.name:40s} │ ID: {dialog.id}")

    print("\nСкопируйте ID нужной хаб-группы и вставьте в .env → HUB_CHAT_ID")
    await client.disconnect()


def main():
    print_header()

    print("Этот скрипт поможет настроить TG-Sync.\n")
    print("Что будем делать:")
    print("  1. Создать .env с вашими данными")
    print("  2. Авторизовать Telegram-аккаунты")
    print("  3. Найти ID хаб-группы")
    print()

    # Шаг 1: .env
    setup_env()

    # Шаг 2–3: Авторизация
    resp = input("\nПерейти к авторизации аккаунтов? (y/n): ")
    if resp.lower() == "y":
        asyncio.run(authorize_accounts())

    # Шаг 4: Hub ID
    resp = input("\nНайти ID хаб-группы? (y/n): ")
    if resp.lower() == "y":
        asyncio.run(find_hub_chat_id())

    print("\n" + "=" * 50)
    print("  ✅ Настройка завершена!")
    print("=" * 50)
    print()
    print("Следующие шаги:")
    print("  1. Проверьте .env — убедитесь что HUB_CHAT_ID заполнен")
    print("  2. Запуск: python main.py")
    print("  3. Или через Docker: docker-compose up -d")
    print()


if __name__ == "__main__":
    main()
